Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine Constructor (PolyLine, Color, Int32, GraphicPolyLine.LineType)
 Create a graphic polyline object.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GraphicPolyLine(
	PolyLine polyLine,
	Color color,
	int width,
	GraphicPolyLine.LineType type
)
Public Sub New (
	polyLine As PolyLine,
	color As Color,
	width As Integer,
	type As GraphicPolyLine.LineType
)
Parameters
polyLine
Type: Tekla.Structures.Geometry3d.PolyLine
The path of the line.
color
Type: Tekla.Structures.Model.UI.Color
The color of the line.
width
Type: System.Int32
The width of the line.
type
Type: Tekla.Structures.Model.UI.GraphicPolyLine.LineType
The type of the line. For example solid, dashed or dotted.
See Also
Reference
GraphicPolyLine Class
GraphicPolyLine Overload
Tekla.Structures.Model.UI Namespace